Tekla Open API Reference for Tekla Structures 2025
SymbolInfo Properties
The SymbolInfo type exposes the following members.
Properties
Name | Description
SymbolFile
 Gets or sets the symbol file. E.g. "xsteel".
SymbolIndex
 Gets or sets the the symbol index. Throws an ArgumentOutOfRangeException if the symbol index is not in the range from 0 to 255.
Top
See Also
Reference
SymbolInfo Class
Tekla.Structures.Drawing Namespace